Revit API Introduction Labs
LabUtils.TypeSelectionFilter.AllowElement Method
 Allow an element of the specified System.Type to be selected.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public bool AllowElement(
	Element e
)
Visual Basic (Declaration)
Public Function AllowElement ( _
	e As Element _
) As Boolean
Visual C++
public:
virtual bool AllowElement(
	Element^ e
) sealed
Parameters
e
Type: Element
A candidate element in selection operation.
Return Value
Return true for specified System.Type, false for all other elements.
Implements
ISelectionFilterAllowElement(Element)
See Also
LabUtils.TypeSelectionFilter Class
Labs Namespace